{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "ĠĠ": 257,
      "ĠĠĠĠ": 258,
      "in": 259,
      "st": 260,
      "Ġa": 261,
      "ĠĠĠ": 262,
      "te": 263,
      "Ġt": 264,
      "re": 265,
      "Ġ=": 266,
      "on": 267,
      "Ġp": 268,
      "or": 269,
      "rin": 270,
      "Ġi": 271,
      "Ġf": 272,
      "le": 273,
      "li": 274,
      "er": 275,
      "um": 276,
      "Ġin": 277,
      "ra": 278,
      "he": 279,
      "rint": 280,
      "ĠĠĠĠĠĠĠ": 281,
      "Ġn": 282,
      "th": 283,
      "ri": 284,
      "list": 285,
      "ti": 286,
      "Ġre": 287,
      "se": 288,
      "ĠĊ": 289,
      "de": 290,
      "Ġc": 291,
      "):": 292,
      "Ġto": 293,
      "Ġw": 294,
      "en": 295,
      "al": 296,
      "un": 297,
      "ur": 298,
      "ro": 299,
      "rite": 300,
      "tion": 301,
      "Ġo": 302,
      "Ġs": 303,
      "urn": 304,
      "turn": 305,
      "Ġthe": 306,
      "Ġreturn": 307,
      "ar": 308,
      "yth": 309,
      "Ġ1": 310,
      "ython": 311,
      "ction": 312,
      "def": 313,
      "Ġ\"": 314,
      "di": 315,
      "Ġof": 316,
      "Ġprint": 317,
      "nd": 318,
      "print": 319,
      "Ġnum": 320,
      "Ġe": 321,
      "at": 322,
      "))": 323,
      "ge": 324,
      "Ġst": 325,
      "Ġlist": 326,
      "Ġ'": 327,
      "ber": 328,
      "Ġif": 329,
      "Ġ[": 330,
      "gra": 331,
      "Ġm": 332,
      "Ġwrite": 333,
      "gram": 334,
      "Ġ+": 335,
      "Ġfun": 336,
      "rogram": 337,
      "(\"": 338,
      "Ġfunction": 339,
      "Ġfor": 340,
      "ct": 341,
      "ter": 342,
      "me": 343,
      "mp": 344,
      "Ġb": 345,
      "Ġpython": 346,
      "Ġand": 347,
      "ce": 348,
      "ue": 349,
      "Ġprogram": 350,
      "Ġ(": 351,
      "ring": 352,
      "ĠW": 353,
      "ĠĠĊ": 354,
      "Ġnumber": 355,
      "ate": 356,
      "Ġra": 357,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 358,
      "ĠWrite": 359,
      "lo": 360,
      "len": 361,
      "Ġ2": 362,
      "Ġis": 363,
      "ĠP": 364,
      "Ġ0": 365,
      "num": 366,
      "ing": 367,
      "ut": 368,
      "ke": 369,
      "ul": 370,
      "up": 371,
      "Ġco": 372,
      "val": 373,
      "an": 374,
      "Ġdi": 375,
      "ort": 376,
      "Ġg": 377,
      "Ġ:": 378,
      "()": 379,
      "la": 380,
      "ord": 381,
      "Ġse": 382,
      "ĠĠĠĠĠĠĠĠ": 383,
      "str": 384,
      "put": 385,
      "nge": 386,
      "ts": 387,
      "Ġd": 388,
      "Ġx": 389,
      "Ġstring": 390,
      "key": 391,
      "for": 392,
      "hi": 393,
      "',": 394,
      "ven": 395,
      "Ġ==": 396,
      "Ġrange": 397,
      "ve": 398,
      "ap": 399,
      "\")": 400,
      "si": 401,
      "Ġ3": 402,
      "test": 403,
      "ver": 404,
      "unt": 405,
      "ĠPython": 406,
      "lse": 407,
      "Ġ{": 408,
      "res": 409,
      "us": 410,
      "Ġ-": 411,
      "value": 412,
      "end": 413,
      "ch": 414,
      "\",": 415,
      "Ġstr": 416,
      "rea": 417,
      "ot": 418,
      "Ġth": 419,
      "men": 420,
      "rom": 421,
      "Ġlen": 422,
      "iven": 423,
      "Ġ*": 424,
      "ck": 425,
      "Ġ5": 426,
      "co": 427,
      "ss": 428,
      "ind": 429,
      "mport": 430,
      "Ġ4": 431,
      "Ġelse": 432,
      "lf": 433,
      "Ġy": 434,
      "ary": 435,
      "Ġl": 436,
      "lemen": 437,
      "00": 438,
      "qu": 439,
      "it": 440,
      "Ġres": 441,
      "ĠT": 442,
      "('": 443,
      "Ġor": 444,
      "')": 445,
      "Ġgiven": 446,
      "ll": 447,
      "ĠC": 448,
      "ted": 449,
      "],": 450,
      "Ġthat": 451,
      "ub": 452,
      "Ġvalue": 453,
      "ir": 454,
      "dict": 455,
      "Ġnumbers": 456,
      "Ġsum": 457,
      "ult": 458,
      "ha": 459,
      "om": 460,
      "uple": 461,
      "Ġ%": 462,
      "wo": 463,
      "])": 464,
      "ow": 465,
      "ig": 466,
      "Ġfrom": 467,
      "ist": 468,
      "ĠN": 469,
      "Ġma": 470,
      "Ġwhi": 471,
      "loat": 472,
      "The": 473,
      "ame": 474,
      "Ġkey": 475,
      "Ġan": 476,
      "Ġ6": 477,
      "ma": 478,
      "dd": 479,
      "tem": 480,
      "Ġcon": 481,
      "per": 482,
      "Ġj": 483,
      "ase": 484,
      "ol": 485,
      "ĠF": 486,
      "heck": 487,
      "ith": 488,
      "ĠS": 489,
      "Ġinput": 490,
      "to": 491,
      "is": 492,
      "Ġ>": 493,
      "id": 494,
      "mo": 495,
      "Ġtwo": 496,
      "Ġnot": 497,
      "Ġcount": 498,
      "ation": 499,
      "Ġcal": 500,
      "ndom": 501,
      "List": 502,
      "Ġelemen": 503,
      "':": 504,
      "ctionary": 505,
      "Ġfind": 506,
      "Ġ<": 507,
      "el": 508,
      "word": 509,
      "gth": 510,
      "time": 511,
      "app": 512,
      "input": 513,
      "Ġus": 514,
      "es": 515,
      "Ġdef": 516,
      "string": 517,
      "Ġ10": 518,
      "fi": 519,
      "ime": 520,
      "get": 521,
      "Ġ+=": 522,
      "..": 523,
      "import": 524,
      "Ġall": 525,
      "Ġv": 526,
      "float": 527,
      "pe": 528,
      "ci": 529,
      "Ġword": 530,
      "Ġde": 531,
      "Ġle": 532,
      "et": 533,
      "__": 534,
      "inal": 535,
      "xt": 536,
      "ble": 537,
      "),": 538,
      "orted": 539,
      "ht": 540,
      "Ġwith": 541,
      "Ġar": 542,
      "ĠĠĠĠĠĠ": 543,
      "Ġne": 544,
      "Ġresult": 545,
      "da": 546,
      "Ġ7": 547,
      "Ġdictionary": 548,
      "append": 549,
      "nce": 550,
      "Ġtest": 551,
      "Ġ8": 552,
      "Ġ#": 553,
      "Ġself": 554,
      "ine": 555,
      "irst": 556,
      "pa": 557,
      "self": 558,
      "mb": 559,
      "Ġcheck": 560,
      "Ġte": 561,
      "low": 562,
      "ĠI": 563,
      "Ġint": 564,
      "ĠA": 565,
      "Ġdate": 566,
      "==": 567,
      "Ġrandom": 568,
      "Ġare": 569,
      "Ġtuple": 570,
      "Ġas": 571,
      "sp": 572,
      "Ġtime": 573,
      "Ġimport": 574,
      "ters": 575,
      "ed": 576,
      "if": 577,
      "art": 578,
      "\":": 579,
      "--": 580,
      "dex": 581,
      "():": 582,
      "ĠĠĠĠĊ": 583,
      "rue": 584,
      "Ġh": 585,
      "Ġ9": 586,
      "ear": 587,
      "ĠD": 588,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 589,
      "move": 590,
      "rac": 591,
      "vert": 592,
      "lit": 593,
      "**": 594,
      "Ġby": 595,
      "10": 596,
      "Ġend": 597,
      "cul": 598,
      "gle": 599,
      "my": 600,
      "Ġk": 601,
      "count": 602,
      "Ġfi": 603,
      "lif": 604,
      "Ġwhile": 605,
      "tems": 606,
      "nt": 607,
      "ta": 608,
      "ĠR": 609,
      "Ġ\",": 610,
      "umber": 611,
      "lass": 612,
      "set": 613,
      "ger": 614,
      "verse": 615,
      "ly": 616,
      "Ġro": 617,
      "qua": 618,
      "int": 619,
      "Ġinte": 620,
      "Ġsub": 621,
      "con": 622,
      "Ġcomp": 623,
      "Ġusing": 624,
      "ray": 625,
      "Ġch": 626,
      "name": 627,
      "que": 628,
      "ĠĠĠĠĠ": 629,
      "sion": 630,
      "ata": 631,
      "culate": 632,
      "arr": 633,
      "][": 634,
      "ĉĊ": 635,
      "Ġr": 636,
      "Ġ/": 637,
      "Ġget": 638,
      "Ġpa": 639,
      "tive": 640,
      "harac": 641,
      "ft": 642,
      "mal": 643,
      "Ġ[]": 644,
      "Ġwhich": 645,
      "number": 646,
      "date": 647,
      "one": 648,
      "\"\"": 649,
      "([": 650,
      ")):": 651,
      "alist": 652,
      "oin": 653,
      "ance": 654,
      "act": 655,
      "tring": 656,
      "ĠProgram": 657,
      "nter": 658,
      "Ġit": 659,
      "Ġmax": 660,
      "Ġla": 661,
      "ĠTrue": 662,
      "!=": 663,
      "20": 664,
      "we": 665,
      "ener": 666,
      "ze": 667,
      "Ġelements": 668,
      "upper": 669,
      "split": 670,
      "sum": 671,
      "Ġelement": 672,
      "tera": 673,
      "Ġvalues": 674,
      "Ġcalculate": 675,
      "its": 676,
      "mat": 677,
      "Ġorig": 678,
      "mbda": 679,
      "fe": 680,
      "alse": 681,
      "gest": 682,
      "lower": 683,
      "ac": 684,
      "cur": 685,
      "Ġsorted": 686,
      "ks": 687,
      "Ġex": 688,
      "Ġfirst": 689,
      "Ġcharac": 690,
      "Ġtemp": 691,
      "of": 692,
      "nte": 693,
      "Ġoriginal": 694,
      "etwe": 695,
      "etween": 696,
      "ali": 697,
      "Ġsi": 698,
      "ty": 699,
      "Ġlength": 700,
      "Ġnew": 701,
      "sort": 702,
      "Ġadd": 703,
      "Enter": 704,
      "Ġbetween": 705,
      "ĠG": 706,
      "Ġhe": 707,
      "Ġconvert": 708,
      "Ġwords": 709,
      ")-": 710,
      "Ġdig": 711,
      ")]": 712,
      "items": 713,
      "vi": 714,
      "())": 715,
      "quare": 716,
      "pla": 717,
      "Ġpro": 718,
      "else": 719,
      "dius": 720,
      "Ġinteger": 721,
      "Ġreturns": 722,
      "Ġun": 723,
      "12": 724,
      "op": 725,
      "stance": 726,
      "Ġremove": 727,
      "ĠFalse": 728,
      "du": 729,
      "son": 730,
      "Ġz": 731,
      "Ġelif": 732,
      "cep": 733,
      "ĠNumber": 734,
      "cond": 735,
      "est": 736,
      "length": 737,
      "mon": 738,
      "Ġ{'": 739,
      "ip": 740,
      "Ġset": 741,
      "Ġdatetime": 742,
      "ise": 743,
      "Ġ20": 744,
      "[:": 745,
      "Ġreverse": 746,
      "ight": 747,
      "actor": 748,
      "ces": 749,
      "ute": 750,
      "inary": 751,
      "Ġele": 752,
      "angle": 753,
      "il": 754,
      "Ġta": 755,
      "Ġmath": 756,
      "Ġarr": 757,
      "]]": 758,
      "Ġalist": 759,
      "mple": 760,
      "quen": 761,
      "ntence": 762,
      "ad": 763,
      "join": 764,
      "ĠRe": 765,
      "from": 766,
      "Ġpo": 767,
      "eri": 768,
      "und": 769,
      "ari": 770,
      "}\")": 771,
      "rig": 772,
      "Ġstart": 773,
      "Ġarea": 774,
      "ulti": 775,
      "reak": 776,
      "fter": 777,
      "ĠL": 778,
      "ther": 779,
      "Ġwhe": 780,
      "]:": 781,
      "our": 782,
      "rence": 783,
      "bj": 784,
      "oo": 785,
      "sub": 786,
      "Ġindex": 787,
      "Ġ\")": 788,
      "cate": 789,
      "Ġen": 790,
      "file": 791,
      "place": 792,
      "Ġmy": 793,
      "Ġ!=": 794,
      "Ġ100": 795,
      "gs": 796,
      "Ġper": 797,
      "ĠM": 798,
      "ĠĠĠĊ": 799,
      "tuple": 800,
      "Ġchar": 801,
      "lement": 802,
      "Ġsort": 803,
      "Ġbreak": 804,
      "ultip": 805,
      "age": 806,
      "ĠE": 807,
      "result": 808,
      "owel": 809,
      "olum": 810,
      "ect": 811,
      "Ġon": 812,
      "ĠĠĠĠĠĠĊ": 813,
      "argest": 814,
      "Ġuser": 815,
      "ĠV": 816,
      "rix": 817,
      "olume": 818,
      "Ġ\"))": 819,
      "enerate": 820,
      "''": 821,
      "class": 822,
      "ne": 823,
      "Ġmo": 824,
      "no": 825,
      "ĠB": 826,
      "Ġ[[": 827,
      "ĠList": 828,
      "as": 829,
      "Ġha": 830,
      "ry": 831,
      "Ġdict": 832,
      "idx": 833,
      "ations": 834,
      ")->": 835,
      "lst": 836,
      "Ġlet": 837,
      "Ġ__": 838,
      "ĠString": 839,
      "right": 840,
      "Ġafter": 841,
      "Ġno": 842,
      "Ġbe": 843,
      "=[": 844,
      "ĠIn": 845,
      "ex": 846,
      "ial": 847,
      "unct": 848,
      "Ġeven": 849,
      "Ġmat": 850,
      "ample": 851,
      "radius": 852,
      "Ġ<=": 853,
      "day": 854,
      "year": 855,
      "Ġitem": 856,
      "Ġmin": 857,
      ",\"": 858,
      "ĠĠĠĠĠĠĠĠĠĠ": 859,
      "Ġname": 860,
      "Ġ12": 861,
      "Ġlists": 862,
      "Ġ(\"": 863,
      "ded": 864,
      "Ġtot": 865,
      "ms": 866,
      "ach": 867,
      "area": 868,
      "Ġpri": 869,
      "dig": 870,
      "\".": 871,
      "cal": 872,
      "},": 873,
      "__(": 874,
      "In": 875,
      "ld": 876,
      "min": 877,
      "erge": 878,
      "Ġsquare": 879,
      "Ġbase": 880,
      "Ġfile": 881,
      "Ġtake": 882,
      "='": 883,
      "Ġsh": 884,
      "max": 885,
      "Ġ,": 886,
      "ĠK": 887,
      "Ġval": 888,
      "Ġac": 889,
      "Ġinto": 890,
      "Ġme": 891,
      "ower": 892,
      "im": 893,
      "}')": 894,
      "random": 895,
      "','": 896,
      "actorial": 897,
      "ele": 898,
      "Ġ{}": 899,
      "reater": 900,
      "Ġ**": 901,
      "----": 902,
      "ĠU": 903,
      "Ġequ": 904,
      "nums": 905,
      "words": 906,
      "Ġtotal": 907,
      "case": 908,
      "Ġlo": 909,
      "ree": 910,
      "Ġarray": 911,
      "11": 912,
      "ror": 913,
      "alue": 914,
      "bject": 915,
      "po": 916,
      "ĠO": 917,
      "Ġitera": 918,
      "rip": 919,
      "args": 920,
      "lambda": 921,
      "ĠCo": 922,
      "irc": 923,
      "ols": 924,
      "ay": 925,
      "Ġfloat": 926,
      "Ġeach": 927,
      "format": 928,
      "((": 929,
      "].": 930,
      "tup": 931,
      "hen": 932,
      "ator": 933,
      "']": 934,
      ")/": 935,
      "eks": 936,
      "Ġord": 937,
      "Ġat": 938,
      "Ġdata": 939,
      "ative": 940,
      "Ġli": 941,
      "ference": 942,
      "bo": 943,
      "ten": 944,
      "Ġmultip": 945,
      "Ġcol": 946,
      "Ġdo": 947,
      "Ġ{\"": 948,
      "Ġcharacters": 949,
      "his": 950,
      "read": 951,
      "Ġ>=": 952,
      "Er": 953,
      "cm": 954,
      "ique": 955,
      "whi": 956,
      "Ġ\"\"\"": 957,
      "Ġprints": 958,
      "Ġlast": 959,
      "imum": 960,
      "Error": 961,
      "100": 962,
      "mpty": 963,
      "Ġpi": 964,
      "char": 965,
      "while": 966,
      "oi": 967,
      "ound": 968,
      "ser": 969,
      "owels": 970,
      "Ġtakes": 971,
      "fg": 972,
      "start": 973,
      "Ġclass": 974,
      "Ġbinary": 975,
      "keys": 976,
      "ĠNone": 977,
      "duct": 978,
      ":{": 979,
      "fa": 980,
      "Ġgenerate": 981,
      "Ġyear": 982,
      "cimal": 983,
      "quence": 984,
      "ou": 985,
      "Ġlargest": 986,
      "malle": 987,
      "'.": 988,
      "14": 989,
      "data": 990,
      "sorted": 991,
      "Ġpre": 992,
      "Ġini": 993,
      "Ġsentence": 994,
      "[-": 995,
      "lter": 996,
      "Ġsecond": 997,
      "....": 998,
      "able": 999
    },
    "merges": [
      "Ġ Ġ",
      "ĠĠ ĠĠ",
      "i n",
      "s t",
      "Ġ a",
      "ĠĠ Ġ",
      "t e",
      "Ġ t",
      "r e",
      "Ġ =",
      "o n",
      "Ġ p",
      "o r",
      "r in",
      "Ġ i",
      "Ġ f",
      "l e",
      "l i",
      "e r",
      "u m",
      "Ġ in",
      "r a",
      "h e",
      "rin t",
      "ĠĠĠĠ ĠĠĠ",
      "Ġ n",
      "t h",
      "r i",
      "li st",
      "t i",
      "Ġ re",
      "s e",
      "Ġ Ċ",
      "d e",
      "Ġ c",
      ") :",
      "Ġt o",
      "Ġ w",
      "e n",
      "a l",
      "u n",
      "u r",
      "r o",
      "ri te",
      "ti on",
      "Ġ o",
      "Ġ s",
      "ur n",
      "t urn",
      "Ġt he",
      "Ġre turn",
      "a r",
      "y th",
      "Ġ 1",
      "yth on",
      "c tion",
      "de f",
      "Ġ \"",
      "d i",
      "Ġo f",
      "Ġp rint",
      "n d",
      "p rint",
      "Ġn um",
      "Ġ e",
      "a t",
      ") )",
      "g e",
      "Ġ st",
      "Ġ list",
      "Ġ '",
      "b er",
      "Ġi f",
      "Ġ [",
      "g ra",
      "Ġ m",
      "Ġw rite",
      "gra m",
      "Ġ +",
      "Ġf un",
      "ro gram",
      "( \"",
      "Ġfun ction",
      "Ġf or",
      "c t",
      "te r",
      "m e",
      "m p",
      "Ġ b",
      "Ġp ython",
      "Ġa nd",
      "c e",
      "u e",
      "Ġp rogram",
      "Ġ (",
      "rin g",
      "Ġ W",
      "ĠĠ Ċ",
      "Ġnum ber",
      "a te",
      "Ġ ra",
      "ĠĠĠĠ ĠĠĠĠĠĠĠ",
      "ĠW rite",
      "l o",
      "le n",
      "Ġ 2",
      "Ġi s",
      "Ġ P",
      "Ġ 0",
      "n um",
      "in g",
      "u t",
      "k e",
      "u l",
      "u p",
      "Ġc o",
      "v al",
      "a n",
      "Ġ di",
      "or t",
      "Ġ g",
      "Ġ :",
      "( )",
      "l a",
      "or d",
      "Ġ se",
      "ĠĠĠĠ ĠĠĠĠ",
      "st r",
      "p ut",
      "n ge",
      "t s",
      "Ġ d",
      "Ġ x",
      "Ġst ring",
      "ke y",
      "f or",
      "h i",
      "' ,",
      "v en",
      "Ġ= =",
      "Ġra nge",
      "v e",
      "a p",
      "\" )",
      "s i",
      "Ġ 3",
      "te st",
      "v er",
      "un t",
      "ĠP ython",
      "l se",
      "Ġ {",
      "re s",
      "u s",
      "Ġ -",
      "val ue",
      "en d",
      "c h",
      "\" ,",
      "Ġst r",
      "re a",
      "o t",
      "Ġt h",
      "m en",
      "ro m",
      "Ġ len",
      "i ven",
      "Ġ *",
      "c k",
      "Ġ 5",
      "c o",
      "s s",
      "in d",
      "mp ort",
      "Ġ 4",
      "Ġe lse",
      "l f",
      "Ġ y",
      "ar y",
      "Ġ l",
      "le men",
      "0 0",
      "q u",
      "i t",
      "Ġre s",
      "Ġ T",
      "( '",
      "Ġ or",
      "' )",
      "Ġg iven",
      "l l",
      "Ġ C",
      "te d",
      "] ,",
      "Ġth at",
      "u b",
      "Ġ value",
      "i r",
      "di ct",
      "Ġnumber s",
      "Ġs um",
      "ul t",
      "h a",
      "o m",
      "up le",
      "Ġ %",
      "w o",
      "] )",
      "o w",
      "i g",
      "Ġf rom",
      "i st",
      "Ġ N",
      "Ġm a",
      "Ġw hi",
      "lo at",
      "T he",
      "a me",
      "Ġ key",
      "Ġa n",
      "Ġ 6",
      "m a",
      "d d",
      "te m",
      "Ġc on",
      "p er",
      "Ġ j",
      "a se",
      "o l",
      "Ġ F",
      "he ck",
      "i th",
      "Ġ S",
      "Ġin put",
      "t o",
      "i s",
      "Ġ >",
      "i d",
      "m o",
      "Ġt wo",
      "Ġn ot",
      "Ġco unt",
      "a tion",
      "Ġc al",
      "nd om",
      "L ist",
      "Ġe lemen",
      "' :",
      "ction ary",
      "Ġf ind",
      "Ġ <",
      "e l",
      "w ord",
      "g th",
      "ti me",
      "ap p",
      "in put",
      "Ġ us",
      "e s",
      "Ġ def",
      "st ring",
      "Ġ1 0",
      "f i",
      "i me",
      "ge t",
      "Ġ+ =",
      ". .",
      "i mport",
      "Ġa ll",
      "Ġ v",
      "f loat",
      "p e",
      "c i",
      "Ġw ord",
      "Ġ de",
      "Ġ le",
      "e t",
      "_ _",
      "in al",
      "x t",
      "b le",
      ") ,",
      "or ted",
      "h t",
      "Ġw ith",
      "Ġa r",
      "ĠĠĠĠ ĠĠ",
      "Ġn e",
      "Ġres ult",
      "d a",
      "Ġ 7",
      "Ġdi ctionary",
      "app end",
      "n ce",
      "Ġ test",
      "Ġ 8",
      "Ġ #",
      "Ġse lf",
      "in e",
      "ir st",
      "p a",
      "se lf",
      "m b",
      "Ġc heck",
      "Ġ te",
      "lo w",
      "Ġ I",
      "Ġin t",
      "Ġ A",
      "Ġd ate",
      "= =",
      "Ġra ndom",
      "Ġa re",
      "Ġt uple",
      "Ġa s",
      "s p",
      "Ġt ime",
      "Ġi mport",
      "ter s",
      "e d",
      "i f",
      "ar t",
      "\" :",
      "- -",
      "de x",
      "( ):",
      "ĠĠĠĠ Ċ",
      "r ue",
      "Ġ h",
      "Ġ 9",
      "e ar",
      "Ġ D",
      "ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ",
      "mo ve",
      "ra c",
      "ver t",
      "li t",
      "* *",
      "Ġb y",
      "1 0",
      "Ġ end",
      "c ul",
      "g le",
      "m y",
      "Ġ k",
      "co unt",
      "Ġf i",
      "li f",
      "Ġwhi le",
      "tem s",
      "n t",
      "t a",
      "Ġ R",
      "Ġ\" ,",
      "um ber",
      "la ss",
      "se t",
      "g er",
      "ver se",
      "l y",
      "Ġ ro",
      "qu a",
      "in t",
      "Ġin te",
      "Ġs ub",
      "c on",
      "Ġco mp",
      "Ġus ing",
      "ra y",
      "Ġc h",
      "n ame",
      "q ue",
      "ĠĠĠĠ Ġ",
      "si on",
      "at a",
      "cul ate",
      "ar r",
      "] [",
      "ĉ Ċ",
      "Ġ r",
      "Ġ /",
      "Ġ get",
      "Ġp a",
      "ti ve",
      "ha rac",
      "f t",
      "m al",
      "Ġ[ ]",
      "Ġwhi ch",
      "num ber",
      "d ate",
      "on e",
      "\" \"",
      "( [",
      ") ):",
      "a list",
      "o in",
      "an ce",
      "a ct",
      "t ring",
      "ĠP rogram",
      "n ter",
      "Ġi t",
      "Ġma x",
      "Ġ la",
      "ĠT rue",
      "! =",
      "2 0",
      "w e",
      "en er",
      "z e",
      "Ġelemen ts",
      "up per",
      "sp lit",
      "s um",
      "Ġelemen t",
      "te ra",
      "Ġvalue s",
      "Ġcal culate",
      "i ts",
      "m at",
      "Ġor ig",
      "mb da",
      "f e",
      "al se",
      "ge st",
      "low er",
      "a c",
      "c ur",
      "Ġs orted",
      "k s",
      "Ġe x",
      "Ġf irst",
      "Ġc harac",
      "Ġte mp",
      "o f",
      "n te",
      "Ġorig inal",
      "et we",
      "etwe en",
      "a li",
      "Ġs i",
      "t y",
      "Ġlen gth",
      "Ġne w",
      "s ort",
      "Ġa dd",
      "E nter",
      "Ġb etween",
      "Ġ G",
      "Ġ he",
      "Ġcon vert",
      "Ġword s",
      ") -",
      "Ġdi g",
      ") ]",
      "i tems",
      "v i",
      "( ))",
      "qua re",
      "p la",
      "Ġp ro",
      "e lse",
      "di us",
      "Ġinte ger",
      "Ġreturn s",
      "Ġ un",
      "1 2",
      "o p",
      "st ance",
      "Ġre move",
      "ĠF alse",
      "d u",
      "s on",
      "Ġ z",
      "Ġe lif",
      "ce p",
      "ĠN umber",
      "con d",
      "e st",
      "len gth",
      "m on",
      "Ġ{ '",
      "i p",
      "Ġse t",
      "Ġdate time",
      "i se",
      "Ġ2 0",
      "[ :",
      "Ġre verse",
      "ig ht",
      "act or",
      "ce s",
      "u te",
      "in ary",
      "Ġe le",
      "an gle",
      "i l",
      "Ġt a",
      "Ġma th",
      "Ġar r",
      "] ]",
      "Ġa list",
      "mp le",
      "qu en",
      "nte nce",
      "a d",
      "j oin",
      "ĠR e",
      "f rom",
      "Ġp o",
      "er i",
      "un d",
      "a ri",
      "} \")",
      "ri g",
      "Ġst art",
      "Ġa rea",
      "ul ti",
      "rea k",
      "f ter",
      "Ġ L",
      "th er",
      "Ġw he",
      "] :",
      "o ur",
      "re nce",
      "b j",
      "o o",
      "s ub",
      "Ġin dex",
      "Ġ\" )",
      "c ate",
      "Ġ en",
      "fi le",
      "pla ce",
      "Ġm y",
      "Ġ !=",
      "Ġ1 00",
      "g s",
      "Ġp er",
      "Ġ M",
      "ĠĠĠ Ċ",
      "t uple",
      "Ġch ar",
      "lemen t",
      "Ġs ort",
      "Ġb reak",
      "ulti p",
      "a ge",
      "Ġ E",
      "res ult",
      "ow el",
      "ol um",
      "e ct",
      "Ġ on",
      "ĠĠĠĠ ĠĠĊ",
      "ar gest",
      "Ġus er",
      "Ġ V",
      "ri x",
      "olum e",
      "Ġ\" ))",
      "ener ate",
      "' '",
      "c lass",
      "n e",
      "Ġm o",
      "n o",
      "Ġ B",
      "Ġ[ [",
      "Ġ List",
      "a s",
      "Ġ ha",
      "r y",
      "Ġdi ct",
      "id x",
      "ation s",
      ")- >",
      "l st",
      "Ġle t",
      "Ġ __",
      "ĠS tring",
      "rig ht",
      "Ġa fter",
      "Ġn o",
      "Ġb e",
      "= [",
      "ĠI n",
      "e x",
      "i al",
      "un ct",
      "Ġe ven",
      "Ġm at",
      "a mple",
      "ra dius",
      "Ġ< =",
      "da y",
      "y ear",
      "Ġi tem",
      "Ġm in",
      ", \"",
      "ĠĠĠĠĠĠĠĠ ĠĠ",
      "Ġn ame",
      "Ġ1 2",
      "Ġlist s",
      "Ġ (\"",
      "de d",
      "Ġto t",
      "m s",
      "a ch",
      "a rea",
      "Ġp ri",
      "di g",
      "\" .",
      "c al",
      "} ,",
      "__ (",
      "I n",
      "l d",
      "m in",
      "er ge",
      "Ġs quare",
      "Ġb ase",
      "Ġfi le",
      "Ġta ke",
      "= '",
      "Ġs h",
      "ma x",
      "Ġ ,",
      "Ġ K",
      "Ġ val",
      "Ġa c",
      "Ġin to",
      "Ġm e",
      "ow er",
      "i m",
      "} ')",
      "ra ndom",
      "', '",
      "actor ial",
      "e le",
      "Ġ{ }",
      "rea ter",
      "Ġ* *",
      "-- --",
      "Ġ U",
      "Ġe qu",
      "num s",
      "word s",
      "Ġtot al",
      "c ase",
      "Ġ lo",
      "re e",
      "Ġar ray",
      "1 1",
      "r or",
      "al ue",
      "bj ect",
      "p o",
      "Ġ O",
      "Ġi tera",
      "ri p",
      "ar gs",
      "la mbda",
      "ĠC o",
      "ir c",
      "ol s",
      "a y",
      "Ġf loat",
      "Ġe ach",
      "for mat",
      "( (",
      "] .",
      "t up",
      "he n",
      "at or",
      "' ]",
      ") /",
      "e ks",
      "Ġ ord",
      "Ġa t",
      "Ġd ata",
      "a tive",
      "Ġ li",
      "fe rence",
      "b o",
      "te n",
      "Ġm ultip",
      "Ġco l",
      "Ġd o",
      "Ġ{ \"",
      "Ġcharac ters",
      "hi s",
      "rea d",
      "Ġ> =",
      "E r",
      "c m",
      "i que",
      "w hi",
      "Ġ\" \"\"",
      "Ġprint s",
      "Ġla st",
      "im um",
      "Er ror",
      "1 00",
      "mp ty",
      "Ġp i",
      "ch ar",
      "whi le",
      "o i",
      "o und",
      "s er",
      "owel s",
      "Ġtake s",
      "f g",
      "st art",
      "Ġc lass",
      "Ġb inary",
      "key s",
      "ĠN one",
      "du ct",
      ": {",
      "f a",
      "Ġg enerate",
      "Ġy ear",
      "ci mal",
      "quen ce",
      "o u",
      "Ġl argest",
      "mal le",
      "' .",
      "1 4",
      "d ata",
      "s orted",
      "Ġp re",
      "Ġin i",
      "Ġse ntence",
      "[ -",
      "l ter",
      "Ġse cond",
      ".. ..",
      "a ble"
    ]
  }
}